modules/models/Admin.php

     public function validatePass(){
         if(!$this->hasErrors()){
             $data = self::find()->where('adminuser = :user and adminpass = :pass',[":user"=>$this->adminuser,":pass"=>md5($this->adminpass)])->one();
---
SELECT * FROM `shop_admin` WHERE adminuser = 'admin' and admiinpass = 'd81f9c1be2e08964bf9f24b15f0e4900'

     public function login($data){
         $this->scenario = 'login';
      if ($this->load($data) && $this->validate()){
        $lifetime = $this->rememberMe ? 24*3600 : 0;
        $session = \Yii::$app->session;
        session_set_cookie_params($lifetime);
        $session['admin'] = [
            'adminuser'=>$this->adminuser,
            'isLogin'=>1
        ];
        $this->updateAll(['logintime'=>time(),'loginip'=>ip2long(\Yii::$app->request->userIP)],'adminuser = :user',[':user'=>$this->adminuser]);
---
UPDATE `shop_admin` SET `logintime`=1534322810, `loginip`='2130706433' WHERE adminuser = 'admin'

     public function reg($data){
         $this->scenario = 'adminadd';
         if ($this->load($data) && $this->validate()){
             $this->adminpass = md5($this->adminpass);
             if ($this->save(false)){
---
INSERT INTO `shop_admin` (`adminuser`, `adminemail`, `adminpass`) VALUES ('admin', '123@qq.com', 'd81f9c1be2e08964bf9f24b15f0e4900')